documentation/tmp/ConsultaComandosEnviadosATM.txt

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<GetDtaLogDataLength xmlns="http://Pentomino.mx/">
			<ip>
				<string>11.50.2.8</string>
			</ip>
			<timeStampStart>2018-05-01-00-00</timeStampStart>
			<timeStampEnd>-1</timeStampEnd>
			<command>
				<string>-1</string>
			</command>
		</GetDtaLogDataLength>
	</s:Body>
</s:Envelope>


<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Body>
		<GetDtaLogDataLengthResponse xmlns="http://Pentomino.mx/">
			<GetDtaLogDataLengthResult>
				<TotalItems>21</TotalItems>
				<TotalPages>1</TotalPages>
			</GetDtaLogDataLengthResult>
		</GetDtaLogDataLengthResponse>
	</soap:Body>
</soap:Envelope>


<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<GetDtaLogPage xmlns="http://Pentomino.mx/">
			<ip>
				<string>11.50.2.8</string>
			</ip>
			<timeStampStart>2018-05-01-00-00</timeStampStart>
			<timeStampEnd>-1</timeStampEnd>
			<command>
				<string>-1</string>
			</command>
			<page>0</page>
		</GetDtaLogPage>
	</s:Body>
</s:Envelope>

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Body>
		<GetDtaLogPageResponse xmlns="http://Pentomino.mx/">
			<GetDtaLogPageResult>
				<DtaLog>
					<Id>140511848</Id>
					<SerializedId>140511848</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525218396515</TimeStamp>
					<Command>listFiles</Command>
					<Parameters>Unable to connect to the remote server</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147322661</Id>
					<SerializedId>147322661</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525714465255</TimeStamp>
					<Command>listFiles</Command>
					<Parameters>Unable to connect to the remote server</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147466428</Id>
					<SerializedId>147466428</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525721549272</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147470220</Id>
					<SerializedId>147470220</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525721718197</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147473297</Id>
					<SerializedId>147473297</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525721858617</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147474731</Id>
					<SerializedId>147474731</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525721924895</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147475769</Id>
					<SerializedId>147475769</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525721970468</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147497790</Id>
					<SerializedId>147497790</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525722987864</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>147499353</Id>
					<SerializedId>147499353</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1525723056506</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>153195729</Id>
					<SerializedId>153195729</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526102092698</TimeStamp>
					<Command>listFiles</Command>
					<Parameters>Unable to connect to the remote server</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>153206011</Id>
					<SerializedId>153206011</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526102779435</TimeStamp>
					<Command>listFiles</Command>
					<Parameters>Unable to connect to the remote server</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>155603127</Id>
					<SerializedId>155603127</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526274813694</TimeStamp>
					<Command>listFiles</Command>
					<Parameters>Unable to connect to the remote server</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>156107075</Id>
					<SerializedId>156107075</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526312143872</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>156270190</Id>
					<SerializedId>156270190</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526323342069</TimeStamp>
					<Command>getConfigKeys</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>156274658</Id>
					<SerializedId>156274658</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526323691382</TimeStamp>
					<Command>listFiles</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>156283804</Id>
					<SerializedId>156283804</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526324383695</TimeStamp>
					<Command>listFiles</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>156308231</Id>
					<SerializedId>156308231</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526325992884</TimeStamp>
					<Command>listFiles</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>156308932</Id>
					<SerializedId>156308932</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526326026741</TimeStamp>
					<Command>executeFile</Command>
					<Parameters>AdminCajero.bat</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>159809838</Id>
					<SerializedId>159809838</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526594484048</TimeStamp>
					<Command>listFiles</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>159810253</Id>
					<SerializedId>159810253</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526594515538</TimeStamp>
					<Command>executeFile</Command>
					<Parameters>AdminCajero.bat</Parameters>
					<AtmId>16281584</AtmId>
				</DtaLog>
				<DtaLog>
					<Id>162146772</Id>
					<SerializedId>162146772</SerializedId>
					<Ip>11.50.2.8</Ip>
					<TimeStamp>1526782777343</TimeStamp>
					<Command>listFiles</Command>
					<Parameters />
					<AtmId>16281584</AtmId>
				</DtaLog>
			</GetDtaLogPageResult>
		</GetDtaLogPageResponse>
	</soap:Body>
</soap:Envelope>

